import styles from './map.module.scss'
import { SocialBlock } from '../../../shared/socialMedia/social'

export const Map=()=>{
    return(
        <div className={styles.container}>
            <div
                className={styles.map}
                style={{
                    backgroundImage: `url('/assets/findUs/map.png')`
                }}
            >
                
            </div>
            <div className={styles.block}>
                <div className={styles.phoneModule}>
                    <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M13.7312 11.4562C13.7312 11.6812 13.6812 11.9125 13.575 12.1375C13.4687 12.3625 13.3313 12.575 13.15 12.775C12.8438 13.1125 12.5062 13.3563 12.125 13.5125C11.75 13.6688 11.3438 13.75 10.9063 13.75C10.2688 13.75 9.5875 13.6 8.86875 13.2938C8.15 12.9875 7.43125 12.575 6.71875 12.0563C6 11.5313 5.31875 10.95 4.66875 10.3062C4.025 9.65625 3.44375 8.975 2.925 8.2625C2.4125 7.55 2 6.8375 1.7 6.13125C1.4 5.41875 1.25 4.7375 1.25 4.0875C1.25 3.6625 1.325 3.25625 1.475 2.88125C1.625 2.5 1.8625 2.15 2.19375 1.8375C2.59375 1.44375 3.03125 1.25 3.49375 1.25C3.66875 1.25 3.84375 1.2875 4 1.3625C4.1625 1.4375 4.30625 1.55 4.41875 1.7125L5.86875 3.75625C5.98125 3.9125 6.0625 4.05625 6.11875 4.19375C6.175 4.325 6.20625 4.45625 6.20625 4.575C6.20625 4.725 6.1625 4.875 6.075 5.01875C5.99375 5.1625 5.875 5.3125 5.725 5.4625L5.25 5.95625C5.18125 6.025 5.15 6.10625 5.15 6.20625C5.15 6.25625 5.15625 6.3 5.16875 6.35C5.1875 6.4 5.20625 6.4375 5.21875 6.475C5.33125 6.68125 5.525 6.95 5.8 7.275C6.08125 7.6 6.38125 7.93125 6.70625 8.2625C7.04375 8.59375 7.36875 8.9 7.7 9.18125C8.025 9.45625 8.29375 9.64375 8.50625 9.75625C8.5375 9.76875 8.575 9.7875 8.61875 9.80625C8.66875 9.825 8.71875 9.83125 8.775 9.83125C8.88125 9.83125 8.9625 9.79375 9.03125 9.725L9.50625 9.25625C9.6625 9.1 9.8125 8.98125 9.95625 8.90625C10.1 8.81875 10.2437 8.775 10.4 8.775C10.5187 8.775 10.6438 8.8 10.7812 8.85625C10.9187 8.9125 11.0625 8.99375 11.2188 9.1L13.2875 10.5687C13.45 10.6812 13.5625 10.8125 13.6312 10.9687C13.6937 11.125 13.7312 11.2812 13.7312 11.4562Z" stroke="#FEFBF7" stroke-miterlimit="10"/>
                    </svg>
                    <span className={styles.phone}>+7 (924) 444-77-77</span>
                </div>
                <div className={styles.addressContainer}>
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12.25 5.83301C12.25 9.91634 7 13.4163 7 13.4163C7 13.4163 1.75 9.91634 1.75 5.83301C1.75 4.44062 2.30312 3.10526 3.28769 2.1207C4.27226 1.13613 5.60761 0.583008 7 0.583008C8.39239 0.583008 9.72774 1.13613 10.7123 2.1207C11.6969 3.10526 12.25 4.44062 12.25 5.83301Z" stroke="#FEFBF7" stroke-linecap="round" stroke-linejoin="round"/>
                    <path d="M7 7.58301C7.9665 7.58301 8.75 6.79951 8.75 5.83301C8.75 4.86651 7.9665 4.08301 7 4.08301C6.0335 4.08301 5.25 4.86651 5.25 5.83301C5.25 6.79951 6.0335 7.58301 7 7.58301Z" stroke="#FEFBF7" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>

                    <span className={styles.address}>г. Томск, Варшавское шоссе 26</span>
                </div>
                <div className={styles.emailModule}>
                    <div>
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M2.33329 2.33301H11.6666C12.3083 2.33301 12.8333 2.85801 12.8333 3.49967V10.4997C12.8333 11.1413 12.3083 11.6663 11.6666 11.6663H2.33329C1.69163 11.6663 1.16663 11.1413 1.16663 10.4997V3.49967C1.16663 2.85801 1.69163 2.33301 2.33329 2.33301Z" stroke="#FEFBF7" stroke-linecap="round" stroke-linejoin="round"/>
                    <path d="M12.8333 3.5L6.99996 7.58333L1.16663 3.5" stroke="#FEFBF7" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>
                    </div>
                    <span className={styles.email}>balans@maiil.ru</span>
                </div>
                <div className={styles.socialBlock}>
                    <SocialBlock/>
                </div>
                <div
                    className={styles.flower}
                    style={{backgroundImage: `url('/assets/flowers/findUsFlower-(2).svg')`}}
                >

                </div>
            </div>

        </div>
    )
}